app/Controllers/ChecklistController.php

SELECT *
FROM `tbl_building`
SELECT *
FROM `tbl_items`
SELECT *
FROM `tbl_users`
SELECT *
FROM `tbl_area_code`
SELECT *
FROM `tbl_findings`
SELECT *
FROM `tbl_priority`
SELECT *
FROM `tbl_checklist`
SELECT *
FROM `tbl_maintenance`
---
    public function index()
    {
        $model1 = new BuildingModel();
        $model2 = new ItemModel();
        $model3 = new UserModel();
        $model4 = new AreaCodeModel();
        $model5 = new FindingsModel();
        $model6 = new PriorityLevelModel();
        $model7 = new ChecklistModel();
        $model8 = new MaintenanceModel();

        $data['buildings'] = $model1->getBuildings();
        $data['areaCodes'] = $model4->getAreaCodes();
        $data['findings']  = $model5->getFindings();
        $data['items']     = [];

        try {
            $data = [
                'buildings'     => $model1->findAll(),
                'items'         => $model2->findAll(),
                'users'         => $model3->findAll(),
                'areaCodes'     => $model4->findAll(),
                'findings'      => $model5->findAll(),
                'prioritys'     => $model6->findAll(),
                'checklist'     => $model7->findAll(),
                'maintenances'  => $model8->findAll(),
            ];