app/Controllers/DashboardController.php

    public function index()
    {
        $session = session();
        $sessionData = [
            'id'             => $session->get('id'),
            'fcusername'     => $session->get('fcusername'),
            'fcempcompany'   => $session->get('fcempcompany'),
            'fcempnumber'    => $session->get('fcempnumber'),
            'fcemplname'     => $session->get('fcemplname'),
            'fcempfname'     => $session->get('fcempfname'),
            'fcempmname'     => $session->get('fcempmname'),
            'fcEmailAddress' => $session->get('fcEmailAddress'),
            'logged_in'      => true
        ];

        $model = new BuildingModel();
        $model1 = new ChecklistModel();

        $buildings = $model->findAll();
        $checklist = $model1->findAll();
---
SELECT *
FROM `tbl_building`
SELECT *
FROM `tbl_checklist`