app/Models/AreaCodeModel.php

SELECT *
FROM `tbl_area_code`
---
    public function getAreaCodes()
    {
        return $this->findAll();