app/Models/BuildingModel.php

    public function getBuildings()
    {
        return $this->findAll();
---
SELECT *
FROM `tbl_building`