app/Models/FindingsModel.php

    public function getFindings()
    {
        return $this->findAll();
---
SELECT *
FROM `tbl_findings`